Lab Activity 14??

Handling EXCEL

Read from an EXCEL file

In [12]:
import pandas as pd

df = pd.read_excel('jaish.xlsx')
print(df)

   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
0       Audi        A6  2021         106               67614          7167084
1    Hyundai     Verna  2020         516               33868         17475888
2        BMW  3 Series  2022         554               63874         35386196
3    Hyundai     Creta  2021         748               29540         22095920
4       Audi        Q5  2020         273               21093          5758389
5       Ford  EcoSport  2023         985               21671         21345935
6     Toyota   Corolla  2023         775               24700         19142500
7        Kia    Seltos  2021         954               50829         48490866
8        Kia  Carnival  2021         110               56440          6208400
9   Mercedes   E-Class  2021         816               25233         20590128
10       Kia     Sonet  2019         513               25387         13023531
11  Mercedes   E-Class  2021         521               43710         22772910
12     Honda      City  2019         155               43164          6690420
13  Mercedes       GLA  2020         121               46255          5596855
14       BMW  3 Series  2023         860               31119         26762340
15    Toyota  Fortuner  2023         511               67992         34743912
16   Hyundai     Verna  2021         374               43978         16447772
17      Audi        Q5  2023         964               29236         28183504
18       Kia     Sonet  2019         810               21254         17215740
19      Audi        A4  2022         871               27391         23857561
20       BMW        X3  2022         833               54889         45722537
21    Toyota  Fortuner  2020         268               27721          7429228
22    Toyota   Corolla  2020         359               18512          6645808
23   Hyundai     Creta  2020         205               57039         11692995
24       Kia  Carnival  2018         239               33715          8057885
25    Toyota  Fortuner  2023         967               45264         43770288
26       BMW        X3  2018         288               65824         18957312
27   Hyundai       i20  2019         616               41994         25868304
28       Kia     Sonet  2023         930               50014         46513020
29   Hyundai       i20  2020         154               45228          6965112
30      Audi        A4  2023         497               61097         30365209
31       Kia     Sonet  2022         435               68359         29736165
32     Honda     Civic  2022         488               46730         22804240
33      Audi        A4  2023         776               20287         15742712
34       BMW        X3  2023         837               15399         12888963
35  Mercedes   E-Class  2020         178               33041          5881298
36      Audi        A6  2022         234               67522         15800148
37   Hyundai       i20  2022         859               58259         50044481
38      Ford   Mustang  2018         800               49376         39500800
39       BMW  3 Series  2019         202               28206          5697612
40  Mercedes       GLA  2023         449               44176         19835024
41    Toyota   Corolla  2022         673               52112         35071376
42    Toyota  Fortuner  2022         141               18112          2553792
43   Hyundai       i20  2022         273               32283          8813259
44       Kia  Carnival  2019         272               27500          7480000
45      Audi        Q5  2018         173               25244          4367212
46       Kia    Seltos  2019         776               47339         36735064
47      Audi        Q5  2022         303               25651          7772253
48       Kia     Sonet  2018         518               49264         25518752
49      Ford     F-150  2020         429               25432         10910328

In [13]:
#Displays the statistics
print(df.describe())

              Year  Units Sold  Price per Unit ($)  Total Sales ($)
count    50.000000   50.000000           50.000000     5.000000e+01
mean   2020.900000  514.180000        40198.740000     2.016194e+07
std       1.669046  284.910132        15695.498586     1.331839e+07
min    2018.000000  106.000000        15399.000000     2.553792e+06
25%    2020.000000  269.000000        26086.000000     7.553063e+06
50%    2021.000000  504.000000        42579.000000     1.821660e+07
75%    2022.000000  794.000000        50625.250000     2.782821e+07
max    2023.000000  985.000000        68359.000000     5.004448e+07

In [14]:
#Displays the rows and columns
print(df.shape)

(50, 6)

In [15]:
#Statistical Information about Excel file
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Car Brand           50 non-null     object
 1   Model               50 non-null     object
 2   Year                50 non-null     int64
 3   Units Sold          50 non-null     int64
 4   Price per Unit ($)  50 non-null     int64
 5   Total Sales ($)     50 non-null     int64
dtypes: int64(4), object(2)
memory usage: 2.5+ KB
None

Extract the contents

In [16]:
#Extract all rows where Units Sold > 500
high_sales = df[df['Units Sold'] > 500]
print("\nCars with Units Sold > 500:")
print(high_sales)

Cars with Units Sold > 500:
   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
1    Hyundai     Verna  2020         516               33868         17475888
2        BMW  3 Series  2022         554               63874         35386196
3    Hyundai     Creta  2021         748               29540         22095920
5       Ford  EcoSport  2023         985               21671         21345935
6     Toyota   Corolla  2023         775               24700         19142500
7        Kia    Seltos  2021         954               50829         48490866
9   Mercedes   E-Class  2021         816               25233         20590128
10       Kia     Sonet  2019         513               25387         13023531
11  Mercedes   E-Class  2021         521               43710         22772910
14       BMW  3 Series  2023         860               31119         26762340
15    Toyota  Fortuner  2023         511               67992         34743912
17      Audi        Q5  2023         964               29236         28183504
18       Kia     Sonet  2019         810               21254         17215740
19      Audi        A4  2022         871               27391         23857561
20       BMW        X3  2022         833               54889         45722537
25    Toyota  Fortuner  2023         967               45264         43770288
27   Hyundai       i20  2019         616               41994         25868304
28       Kia     Sonet  2023         930               50014         46513020
33      Audi        A4  2023         776               20287         15742712
34       BMW        X3  2023         837               15399         12888963
37   Hyundai       i20  2022         859               58259         50044481
38      Ford   Mustang  2018         800               49376         39500800
41    Toyota   Corolla  2022         673               52112         35071376
46       Kia    Seltos  2019         776               47339         36735064
48       Kia     Sonet  2018         518               49264         25518752

In [17]:
#Extract only BMW 
bmw_cars = df[df['Car Brand'] == 'BMW']
print("\nBMW Cars:")
print(bmw_cars)

BMW Cars:
   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
2        BMW  3 Series  2022         554               63874         35386196
14       BMW  3 Series  2023         860               31119         26762340
20       BMW        X3  2022         833               54889         45722537
26       BMW        X3  2018         288               65824         18957312
34       BMW        X3  2023         837               15399         12888963
39       BMW  3 Series  2019         202               28206          5697612

In [18]:
#Select only Car Brand and Total Sales columns
sales_summary = df[['Car Brand', 'Total Sales ($)']]
print("\nCar Brand with Total Sales:")
print(sales_summary)

Car Brand with Total Sales:
   Car Brand  Total Sales ($)
0       Audi          7167084
1    Hyundai         17475888
2        BMW         35386196
3    Hyundai         22095920
4       Audi          5758389
5       Ford         21345935
6     Toyota         19142500
7        Kia         48490866
8        Kia          6208400
9   Mercedes         20590128
10       Kia         13023531
11  Mercedes         22772910
12     Honda          6690420
13  Mercedes          5596855
14       BMW         26762340
15    Toyota         34743912
16   Hyundai         16447772
17      Audi         28183504
18       Kia         17215740
19      Audi         23857561
20       BMW         45722537
21    Toyota          7429228
22    Toyota          6645808
23   Hyundai         11692995
24       Kia          8057885
25    Toyota         43770288
26       BMW         18957312
27   Hyundai         25868304
28       Kia         46513020
29   Hyundai          6965112
30      Audi         30365209
31       Kia         29736165
32     Honda         22804240
33      Audi         15742712
34       BMW         12888963
35  Mercedes          5881298
36      Audi         15800148
37   Hyundai         50044481
38      Ford         39500800
39       BMW          5697612
40  Mercedes         19835024
41    Toyota         35071376
42    Toyota          2553792
43   Hyundai          8813259
44       Kia          7480000
45      Audi          4367212
46       Kia         36735064
47      Audi          7772253
48       Kia         25518752
49      Ford         10910328

Write the output of a Query into an EXCEL File

In [21]:
# Write the query results to a new Excel file

#Extract cars with Units Sold > 500
high_sales_df = df[df['Units Sold'] > 500]
print("\nCars with Units Sold > 500:")
print(high_sales_df)

#Write the query results to a new Excel file
output_file = '/mnt/data/high_sales.xlsx'
high_sales_df.to_excel(output_file, index=False)

Cars with Units Sold > 500:
   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
1    Hyundai     Verna  2020         516               33868         17475888
2        BMW  3 Series  2022         554               63874         35386196
3    Hyundai     Creta  2021         748               29540         22095920
5       Ford  EcoSport  2023         985               21671         21345935
6     Toyota   Corolla  2023         775               24700         19142500
7        Kia    Seltos  2021         954               50829         48490866
9   Mercedes   E-Class  2021         816               25233         20590128
10       Kia     Sonet  2019         513               25387         13023531
11  Mercedes   E-Class  2021         521               43710         22772910
14       BMW  3 Series  2023         860               31119         26762340
15    Toyota  Fortuner  2023         511               67992         34743912
17      Audi        Q5  2023         964               29236         28183504
18       Kia     Sonet  2019         810               21254         17215740
19      Audi        A4  2022         871               27391         23857561
20       BMW        X3  2022         833               54889         45722537
25    Toyota  Fortuner  2023         967               45264         43770288
27   Hyundai       i20  2019         616               41994         25868304
28       Kia     Sonet  2023         930               50014         46513020
33      Audi        A4  2023         776               20287         15742712
34       BMW        X3  2023         837               15399         12888963
37   Hyundai       i20  2022         859               58259         50044481
38      Ford   Mustang  2018         800               49376         39500800
41    Toyota   Corolla  2022         673               52112         35071376
46       Kia    Seltos  2019         776               47339         36735064
48       Kia     Sonet  2018         518               49264         25518752

OSError: Cannot save file into a non-existent directory: '\mnt\data'

Append to an Excel file

In [22]:
import pandas as pd

# Create a small DataFrame with new car sales data to append
new_data = pd.DataFrame({
    "Car Brand": ["Gordon Murray"],
    "Model": ["T.50"],
    "Year": [2023],
    "Units Sold": [50],
    "Price per Unit ($)": [4000000],
    "Total Sales ($)": [50 * 4000000]
})

#Convert into DataFrame
new_orders_df = pd.DataFrame(new_data)
print(new_orders_df)

       Car Brand Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
0  Gordon Murray  T.50  2023          50             4000000        200000000

Read a Excel Chunk-by-chunk

In [27]:
import pandas as pd

#Convert Excel to CSV
df = pd.read_excel("jaish.xlsx")
df.to_csv("jaish.csv", index=False)

# read the CSV in chunks
for i, chunk in enumerate(pd.read_csv("jaish.csv", chunksize=10)):
    print(f"\n--- Chunk {i+1} ---")
    display(chunk)

--- Chunk 1 ---

  Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
0      Audi        A6  2021         106               67614          7167084
1   Hyundai     Verna  2020         516               33868         17475888
2       BMW  3 Series  2022         554               63874         35386196
3   Hyundai     Creta  2021         748               29540         22095920
4      Audi        Q5  2020         273               21093          5758389
5      Ford  EcoSport  2023         985               21671         21345935
6    Toyota   Corolla  2023         775               24700         19142500
7       Kia    Seltos  2021         954               50829         48490866
8       Kia  Carnival  2021         110               56440          6208400
9  Mercedes   E-Class  2021         816               25233         20590128

--- Chunk 2 ---

   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
10       Kia     Sonet  2019         513               25387         13023531
11  Mercedes   E-Class  2021         521               43710         22772910
12     Honda      City  2019         155               43164          6690420
13  Mercedes       GLA  2020         121               46255          5596855
14       BMW  3 Series  2023         860               31119         26762340
15    Toyota  Fortuner  2023         511               67992         34743912
16   Hyundai     Verna  2021         374               43978         16447772
17      Audi        Q5  2023         964               29236         28183504
18       Kia     Sonet  2019         810               21254         17215740
19      Audi        A4  2022         871               27391         23857561

--- Chunk 3 ---

   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
20       BMW        X3  2022         833               54889         45722537
21    Toyota  Fortuner  2020         268               27721          7429228
22    Toyota   Corolla  2020         359               18512          6645808
23   Hyundai     Creta  2020         205               57039         11692995
24       Kia  Carnival  2018         239               33715          8057885
25    Toyota  Fortuner  2023         967               45264         43770288
26       BMW        X3  2018         288               65824         18957312
27   Hyundai       i20  2019         616               41994         25868304
28       Kia     Sonet  2023         930               50014         46513020
29   Hyundai       i20  2020         154               45228          6965112

--- Chunk 4 ---

   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
30      Audi        A4  2023         497               61097         30365209
31       Kia     Sonet  2022         435               68359         29736165
32     Honda     Civic  2022         488               46730         22804240
33      Audi        A4  2023         776               20287         15742712
34       BMW        X3  2023         837               15399         12888963
35  Mercedes   E-Class  2020         178               33041          5881298
36      Audi        A6  2022         234               67522         15800148
37   Hyundai       i20  2022         859               58259         50044481
38      Ford   Mustang  2018         800               49376         39500800
39       BMW  3 Series  2019         202               28206          5697612

--- Chunk 5 ---

   Car Brand     Model  Year  Units Sold  Price per Unit ($)  Total Sales ($)
40  Mercedes       GLA  2023         449               44176         19835024
41    Toyota   Corolla  2022         673               52112         35071376
42    Toyota  Fortuner  2022         141               18112          2553792
43   Hyundai       i20  2022         273               32283          8813259
44       Kia  Carnival  2019         272               27500          7480000
45      Audi        Q5  2018         173               25244          4367212
46       Kia    Seltos  2019         776               47339         36735064
47      Audi        Q5  2022         303               25651          7772253
48       Kia     Sonet  2018         518               49264         25518752
49      Ford     F-150  2020         429               25432         10910328

Writing numeric data to a new Excel file

In [28]:
# Create numeric data
data = {
    "Product_ID": [101, 102, 103, 104],
    "Quantity_Sold": [20, 35, 15, 50],
    "Price_Per_Unit": [100, 150, 120, 80],
    "Total_Sales": [20*100, 35*150, 15*120, 50*80]  # Calculated column
}

# Convert to DataFrame
df = pd.DataFrame(data)

# Write to Excel
output_file = "numeric_data_ExcelSheet.xlsx"
df.to_excel(output_file, index=False)

print(f"Numeric data written successfully to {output_file}")

Numeric data written successfully to numeric_data_ExcelSheet.xlsx

In [29]:
data = pd.read_excel('numeric_data_ExcelSheet.xlsx')
print(data) # print the numeric data from excel

   Product_ID  Quantity_Sold  Price_Per_Unit  Total_Sales
0         101             20             100         2000
1         102             35             150         5250
2         103             15             120         1800
3         104             50              80         4000

Write text data into a Excel File

In [30]:
import pandas as pd

# Create text data
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston"],
    "Department": ["HR", "IT", "Finance", "Marketing"]
}

#Convert to DataFrame
df = pd.DataFrame(data)

#Write to Excel
output_file = "text_data_excelsheet.xlsx"
df.to_excel(output_file, index=False)

print(f"Text data written successfully to {output_file}")

Text data written successfully to text_data_excelsheet.xlsx

In [31]:
data = pd.read_excel('text_data_excelsheet.xlsx')
print(data) # print the text data from excel

      Name         City Department
0    Alice     New York         HR
1      Bob  Los Angeles         IT
2  Charlie      Chicago    Finance
3    David      Houston  Marketing

Handling JSON

Write the output of a Python Code into a JSON Format/File

In [33]:
import json

In [35]:
import pandas as pd

# Read the Excel file
df = pd.read_excel("jaish.xlsx")

# Convert DataFrame to JSON and save to file
output_file = "jaish.json"
df.to_json(output_file, orient="records", indent=4)

print(f"Data successfully written to {output_file}")

Data successfully written to jaish.json

In [37]:
#display data
display(pd.DataFrame(data))

      Name         City Department
0    Alice     New York         HR
1      Bob  Los Angeles         IT
2  Charlie      Chicago    Finance
3    David      Houston  Marketing